In [1]:
# Import the packages
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,'Hyd','Mumbai','Chennai']}

pd.DataFrame(dict1)

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [3]:
data1=pd.DataFrame(dict1)

In [4]:
data1.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [5]:
data1.isnull().sum()
# every column has one missing value is there

Names    1
Age      1
City     1
dtype: int64

In [6]:
data1.isnull().sum()/len(data1)

Names    0.25
Age      0.25
City     0.25
dtype: float64

In [7]:
data1.isnull().sum()*100/len(data1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [8]:
data1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [9]:
dict2={'Names':['Ramesh','Suresh',None,'Mahesh'],
      'Age':[31,32,33,None],
      'City':[None,'Hyd','Mumbai','Chennai']}

In [11]:
data2=pd.DataFrame(dict2)
data2

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [12]:
data2.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [13]:
data2.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [14]:
dict3={'Names':['Ramesh','Suresh','Null','Mahesh'],
      'Age':[31,32,33,'Null'],
      'City':['Null','Hyd','Mumbai','Chennai']}

In [15]:
data3=pd.DataFrame(dict3)
data3

    Names   Age     City
0  Ramesh    31     Null
1  Suresh    32      Hyd
2    Null    33   Mumbai
3  Mahesh  Null  Chennai

In [ ]:
data2.isnull()

In [ ]:
data3.isnull().sum()

**Method-1**
>Fill the missing values with random number

dataframe name = data1

method name:fillna

In [16]:
data1.fillna(40)

    Names   Age     City
0  Ramesh  31.0       40
1  Suresh  32.0      Hyd
2      40  33.0   Mumbai
3  Mahesh  40.0  Chennai

**Method-2**

>Fill the missing values with random number on specific column

dataframe name= data1

method name:fillna

In [17]:
data1['Names'].fillna('Sathish')

0     Ramesh
1     Suresh
2    Sathish
3     Mahesh
Name: Names, dtype: object

In [ ]:
data1['Names'].fillna('Sathish',inplace=True)
data1

In [ ]:
# Create the data again
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,'Hyd','Mumbai','Chennai']}

data1=pd.DataFrame(dict1)
data1

**Method-3**

- bfill
- ffill
- pad
- backfill

In [18]:
data1.fillna(method='backfill')
# Names index 2 is missing value
#          it will replace by index 3 value
# Age index 3 is missing value
#           we dont have index 4, so the value is NaN
# City index 0 has missed value
#           it replace with index 1 value

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [19]:
data1.fillna(method='bfill')

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [20]:
data1.fillna(method='ffill')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [21]:
data1.fillna(method='pad')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

- bfill and backfill both are same
- pad and ffill both are same

**Method-4**

- Mean
- Median
- Mode

In [22]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [23]:
age_mean=data1['Age'].mean()
age_mean

32.0

In [25]:
data1['Age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [ ]:
# instead of providing a random number
# we are fill with mean of the data

In [24]:
age_median=data1['Age'].median()
age_median

32.0

In [26]:
data1['Age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [27]:
data1['Age'].fillna(age_median,inplace=True)

In [28]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh  32.0  Chennai

In [29]:
age_mode=data1['Age'].mode()
age_mode

0    32.0
Name: Age, dtype: float64

In [30]:
data1['Age'].fillna(age_mode)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [ ]:
# Level1: Mean median mode
# Level2: bfill fill
# level3:

**Method-5:**
>KNN imputer

KNN : K nearest neighbours

- in the KNN imputer instead of taking mean of the values
- will choose neigbours data
- will take those mean only

**KNN imputer**

<img src="https://miro.medium.com/v2/resize:fit:1400/1*9LeaMTcOXxeTPN-VCbKloQ.png" jsaction="VQAsE" class="sFlh5c pT0Scc iPVvYb" style="max-width: 868px; width: 351px; height: 121px; margin: 12.5px 0px;" alt="Optimising pairwise Euclidean distance calculations using ..." jsname="kn3ccd" aria-hidden="false">


<img src="https://hlab.stanford.edu/brian/making7.gif" jsaction="VQAsE" class="sFlh5c pT0Scc iPVvYb" style="max-width: 668px; height: 392px; margin: 0px; width: 465px;" alt="Measuring Dis/Similarities" jsname="kn3ccd" aria-hidden="false">

In [ ]:
n_neighbors is parameter can choose by user

if we dont choose by default it will takes as

In [ ]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['Age']])

In [ ]:
data1

**Method-6:**
    
- based on other columns

- some times all above methods will not provide good justification

- at that time we need to check other columns dependancy also

- Most of the time will pick a column which have highest correlation